Autodesk.Revit.DB.WorksetDefaultVisibilitySettings.GetWorksetDefaultVisibilitySettings(Autodesk.Revit.DB.Document)
Get the WorksetDefaultVisibilitySettings of the document.
Remarks:
WorksetDefaultVisibilitySettings is not available in family documents.
aDoc:
The document.
Returns:
The WorksetDefaultVisibilitySettings of the document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
WorksetDefaultVisibilitySettings is not applicable to family documents.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.WorksetDefaultVisibilitySettings.SetWorksetVisibility(Autodesk.Revit.DB.WorksetId,System.Boolean)
Set the default visibility of a workset.
worksetId:
Id of the workset.
visible:
Whether the workset should be visible by default or not.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no workset with this Id in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
WorksetDefaultVisibilitySettings is not applicable to family documents.
Since:
2012

Autodesk.Revit.DB.WorksetDefaultVisibilitySettings.IsWorksetVisible(Autodesk.Revit.DB.WorksetId)
Indicates whether the workset is visible by default.
worksetId:
Id of the workset.
Returns:
Whether the workset is visible by default.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no workset with this Id in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
WorksetDefaultVisibilitySettings is not applicable to family documents.
Since:
2012